# Итоговая контрольная работа по основному блоку

## Задача

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Примеры ответа

* [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
* [“1234”, “1567”, “-2”, “computer science”] → [“-2”]
* [“Russia”, “Denmark”, “Kazan”] → []

## Решение

Были созданы следующие *функции*:

1. **Prompt** - функция, которая:

* на вход принимает строковое сообщение
* возвращает сообщение пользователю
* принимает от пользователя целое число в строковом типе
* преобразует целое число в целочисленный тип
* возвращает целое число

```
    int Prompt(string message)
    {
        System.Console.Write(message); // вывести сообщение
        string? value = System.Console.ReadLine(); // считывает с консоли
        int result = Convert.ToInt32(value); // преобразует строку в целое число
        return result; // возвращает результат
    }
```

2. **PromptEl** - функция, которая:

* на вход принимает строковое сообщение
* возвращает сообщение пользователю
* принимает от пользователя значение в строковом типе
* возвращает строковый тип

```
    string PromptEl(string message)
    {
        System.Console.Write(message); // вывести сообщение
        string? value = System.Console.ReadLine(); // считывает с консоли
        return value; // возвращает результат
    }
```

3. **InsertArray** - функция, которая:

* на вход принимает длину массива в целочисленном типе
* создаёт пустой массив заданной длины
* методом цикла от 0 до заданной длины с шагом 1 предлагает пользователю ввести новый элемент массива в строковом типе 
  (посредством функции **PromptEl**)
* возвращает созданный массив

```
    string[] InsertArray(int len)
    {
        string[] myArr = new string[len]; // создаёт заготовку массива в соответствии с заданной длиной
        for (int i=0; i < len; i++) 
        {
            myArr[i] = PromptEl($"Введите {i+1}-й элемент массива: "); // предлагает пользователю ввести элемент массива
        }
        return myArr; // возвращает массив
    }
```

4. **CheckArray** - функция, которая:

* на вход принимает ранее созданный массив
* создаёт пустой безразмерный список
* методом прохода по элементам входящего массива проверяет длину элемента массива
* если длина элемента массива меньше или равна 3, то добавляет элемент массива в безразмерный список
* создаёт вспомогательный счётчик, равный изначально 0 
* создаёт пустой массив длины безразмерного списка
* методом прохода по элементам безразмерного списка добавляет каждый элемент списка в новый массив
* с каждым проходом увеличивает счётчик на 1
* возвращает созданный массив

```
    string[] CheckArray(string[] myArr)
    {
        List<string> newList = new List<string>(); // создаёт безразмерный список
        foreach (string item in myArr) 
        {
            if (item.Length <= 3)
            {
                newList.Add(item); // добавляет элемент массива, если его длина меньше или равна 3
            }
        }

        int count = 0; // создаёт счётчик с 0
        string[] newArr = new string[newList.Count]; // создаёт заготовку массива в соответствии с длиной списка
        foreach (string item in newList) 
        {
            newArr[count] = item; // добавляет элемент из списка
            count += 1; // увеличивает счётчик на 1
        }
        return newArr; // возвращает массив
    }
```

В *основной части* программа:

1. При помощи функции **Prompt** запрашивает длину массива у пользователя
2. Посредством цикла **while** запрашивает корректную длину массива у пользователя, пока она не станет больше 0
3. При помощи функции **InsertArray** запрашивает элементы массива у пользователя
4. Готовит первую часть вывода итогового сообщения для пользователя ([<*заданный пользователем массив*>] → )
5. При помощи функции **CheckArray** проверяет элементы массива и элементы, удовлетворяющие условию задачи, добавляет в новый массив
6. Возвращает пользователю итоговое сообщение:
    * если длина полученного массива 0, то возвращает пользователю итоговое сообщение вида: [<*заданный пользователем массив*>] → []
    * если длина больше 0, то - [<*заданный пользователем массив*>] → [<*полученный массив*>]

```
    int len = Prompt("Введите длину массива: ");

    while (len <= 0) {
        Console.Write("Длина массива должна быть больше 0!\n");
        len = Prompt("Введите длину массива: ");
    }

    string[] myArr = InsertArray(len);

    string body = $"['{string.Join("', '", myArr)}'] → ";
    System.Console.Write(body);

    string[] result = CheckArray(myArr);
    if (result.Length == 0) 
    {
        System.Console.Write("[]");
    }
    else 
    {
        System.Console.Write($"['{string.Join("', '", result)}']");
    }
```

Для того, чтобы *запустить программу*, необходимо:

1. Клонировать репозиторий посредством `git clone`
2. Войти в папку Task: `cd Task`
3. Запустить программу: `dotnet run`
